src/DataProcessors/ГлавнаяФормаМОКП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ГлавнаяФормаМОКП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>докВозврат</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.Возврат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentObject.Заказ</v8:Type>
						<v8:Type>cfg:DocumentObject.Возврат</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КаталогиТоваров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСУП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьКоличества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросКоличества</Name>
					<Comment>при подборе в заказ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельнойСтрокой</Name>
					<Comment>при упаковке заказа не сворачивать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаличияВПродаже</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаличияВПродаже</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродаже</Name>
					<Comment>по дням недели</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродажеВремя1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВПродажеВремя2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПечати</Name>
					<Comment>что печатать на чеке и счете</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выход</Name>
					<Comment>только для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэфПересчета</Name>
					<Comment>в номенклатуру</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСпецифик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинУдельныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксУдельныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>для установки произвольного порядка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонусы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммутироемоеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоммутируемыеУстройства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Comment>разделитель в заказе (тарелка, упаковка)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПриготовления</Name>
					<Comment>в минутах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппаЕдиниц</Name>
					<Comment>Внутри группы располагаются разные единицы одного и того же наименования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтроляПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтроляПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>фАлкоголь</Name>
					<Comment>1-алкоголь, 2- алкогольное пиво</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемБутылки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляМарки</Name>
					<Comment>короткое наименования для отображения в марке повара</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PLU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоНеделям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПонедельника</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВПродаже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродаже</Name>
							<Comment>по дням недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ГлавнаяФормаМОКП/Forms/ФормаПовара/module.bsl
Перем ФормаСкрытияМеню, фФормаСкрытияМеню;
Перем мСдвигаемыеЭлементы;
Перем ОтборФирма;
Перем КупоныСоответствие Экспорт;
Перем МакетПодвал;
Перем ТекСтрокаТП;

Процедура СкрытьПоказатьКнопки(Показать = Ложь)
	Для Каждого Эл Из ЭлементыФормы Цикл
		Если СтрНачинаетсяС(Эл.Имя, "Кнопка") или СтрНачинаетсяС(Эл.Имя, "Плашка") Тогда
			Эл.Видимость = Показать;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементыФормы.НадписьЛояльность1.Видимость = Показать;
	
КонецПроцедуры


Процедура ОбновитьНадписьИтого() Экспорт
	Если Не ЭтаФорма.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
			
	Попытка
		ДатаРождения = Заказ.ДатаРождения;
	Исключение
		ДатаРождения = Дата(1,1,1);
	КонецПопытки;
	
	Если ТекущийРежим = "ВОЗВРАТ" Тогда
		ЭлементыФормы.тпТовары.Видимость = 0;
		ЭлементыФормы.тпТоварыВозврат.Видимость = 1;
		//ЭлементыФормы.ТеньТовары.Видимость = 1;
		СкрытьПоказатьКнопки(Истина);
	ИначеЕсли  ТекущийРежим = "ПРОДАЖА" Тогда
		ЭлементыФормы.тпТовары.Видимость = 1;
		ЭлементыФормы.тпТоварыВозврат.Видимость = 0;
		//ЭлементыФормы.ТеньТовары.Видимость = 1;
		СкрытьПоказатьКнопки(Истина);
	Иначе
		//ЭлементыФормы.ТеньТовары.Видимость = 0;
		ЭлементыФормы.тпТовары.Видимость = 0;
		ЭлементыФормы.тпТоварыВозврат.Видимость = 0;
		Если ксТрактир.ВыданныеПейджеры(Заказ.Ссылка).Количество() Тогда
			ЭлементыФормы.кнПейджер.Видимость = Истина;
		Иначе
			ЭлементыФормы.кнПейджер.Видимость = Ложь;
		КонецЕсли;

		СкрытьПоказатьКнопки();
	КонецЕсли;
	ИтогоСумма = 0;
	ИтогоКоличество = 0;
	ЕстьЧужиеТовары = Ложь;
	ТекСтрокаТП = ЭлементыФормы.тпТовары.ТекущаяСтрока;
	ТекСтрока = Неопределено;
	Если ТекСтрокаТП <> Неопределено Тогда
		Попытка
			ТекСтрока = ТекущийДокумент.Товары.Найти(ТекСтрокаТП.ИдСтроки);		
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ЗаполнитьТПтовары();
	Если ТекущийРежим = "" Тогда
		ЕстьТовары = Ложь;
		
	Иначе
		Если ТекущийДокумент.Товары.Количество() Тогда
			ТекСтрока = ТекущийДокумент.Товары[ТекущийДокумент.Товары.Количество()-1];
		Иначе
			ТекСтрока = Неопределено;
		КонецЕсли;
		
		Для Каждого Т Из ТекущийДокумент.Товары Цикл
			Если т.Фирма <> глПараметрыРМ.Фирма Тогда
				ЕстьЧужиеТовары = Истина;
			КонецЕсли;
			Если Т.СтатусОплаты = -1 Тогда
				Попытка
					ИтогоСумма = ИтогоСумма + ?(ТекущийРежим = "ПРОДАЖА", Т.СуммаРеализации, Т.Сумма);	
					ИтогоКоличество = ИтогоКоличество + Т.Количество;
				Исключение
				КонецПопытки;                                        
				
				Если Т.Количество И ТекСтрока = Неопределено Тогда
					ТекСтрока = Т;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		Попытка
			ТекСтрокаТП = тпТовары.Строки.Найти(ТекСтрока.ИдСтроки);				
			ПодключитьОбработчикОжидания("УстановитьТекСтроку", 0.2, 1);
		Исключение
		КонецПопытки;
		
		ЕстьТовары = ИтогоКоличество;
	КонецЕсли;
	
	
	
	Если ЕстьТовары Тогда 
		СуммаКоплате = Формат(ИтогоСумма, "ЧДЦ=2; ЧРД=.; ЧН=-") + " " + глСимволРубля;
	Иначе
		СуммаКоплате = "";
	КонецЕсли;
	
	тЗаказ = "Заказ  " + НомерТекущегоЗаказа() + Символы.ПС;
	Если ЕстьЧужиеТовары Тогда
		тЗаказ = тЗаказ + ?(Не ОтборФирма, "Весь заказ", "По станции");	
	КонецЕсли;

	
	Если НадписьСдача <> Неопределено Тогда
		//ЭлементыФормы.НадписьСумма.Заголовок = "Сдача";
		СуммаКоплате = СтрЗаменить(НадписьСдача, ",", ".");  
	ИначеЕсли ТекущийДокумент = Неопределено Тогда
		//ЭлементыФормы.НадписьСумма.Заголовок = "";
	Иначе
		//ЭлементыФормы.НадписьСумма.Заголовок = "К оплате";
		Если Не ИтогоСумма Тогда
			//ЭлементыФормы.НадписьСумма.Заголовок = "";
		КонецЕсли;
	КонецЕсли;
	НадписьЛояльность = "";
	Если ТекущийДокумент <> Неопределено Тогда
		
		Если ЕстьТовары Тогда
			
			Попытка
				ТекущийЭлемент = ЭлементыФормы.Плашка11;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		
		
		Если ЗначениеЗаполнено(ТекущийДокумент.НомерКартыЛояльности) Тогда
			Если СтрДлина(СокрП(ТекущийДокумент.НомерКартыЛояльности)) <= 10 Тогда
				НадписьЛояльность = "Карта: ******"+Прав(ТекущийДокумент.НомерКартыЛояльности,4);
			Иначе
				НадписьЛояльность = "Карта применена";
			КонецЕсли;
		КонецЕсли;
		
		//Если Не ТекущийДокумент.КартаДоступа.Пустая() Тогда
		//	НадписьЛояльность = НадписьЛояльность + ?(НадписьЛояльность = "", "", Символы.ПС) +	"Карта доступа " + ТекущийДокумент.КартаДоступа;
		//КонецЕсли;
		
		Если ТипЗнч(ТекущийДокумент) = Тип("ДокументОбъект.Заказ") Тогда
			Если ТекущийДокумент.Купоны.Количество() Тогда
				НадписьЛояльность = НадписьЛояльность + Символы.ПС + "Сертификат" + ?(ТекущийДокумент.Купоны.Количество() = 1, " ", "ы ") + "применен" + ?(ТекущийДокумент.Купоны.Количество() = 1, " ", "ы ");
			КонецЕсли;
		КонецЕсли;
		
		
		//ЭлементыФормы.Количество.Заголовок = "КОЛ-ВО";
		Если ЗначениеЗаполнено(ТекКоличество) Тогда
			Если ТекКоличество<>1 Тогда
				//ЭлементыФормы.Количество.Заголовок = ТекКоличество;
			КонецЕсли;
		КонецЕсли;
		//УстановитьВидимостьКнопки("Количество", 1,,,0);	
	Иначе
		//УстановитьВидимостьКнопки("Количество", 0,,,0);	
	КонецЕсли;
	
	//ИнтерфейсРМ.ЗаполнитьПодвал(ЭлементыФормы.ТабДокПодвал, Заказ, МакетПодвал);	
КонецПроцедуры

Процедура УстановитьТекСтроку() Экспорт
	Попытка
		Если Не ТекСтрокаТП = Неопределено Тогда
			ЭлементыФормы.тпТовары.ТекущаяСтрока = ТекСтрокаТП;
		КонецЕсли;                                                  		
	Исключение
		РаботаСокнами.ПоказатьПлашку(":-( ошибка", ОписаниеОшибки());
	КонецПопытки;                                           	
КонецПроцедуры

Процедура УстановитьСвойствоКнопки(ИмяКнопки, ЗначениеСвойства, Акцент = 0, Свойство = "Доступность", МенятьЦвет = Истина) Экспорт
	Кнопка = ЭлементыФормы[ИмяКнопки];
	МассивТеней = Новый Массив;	
	Тень1 = ЭлементыФормы.Найти(ИмяКнопки+"Тень2");
	Если Не Тень1 = Неопределено Тогда
	
		МассивТеней.Добавить(Тень1);
	
	КонецЕсли; 

	Тень2 = ЭлементыФормы.Найти(ИмяКнопки+"Тень2");
	Если Не Тень2 = Неопределено Тогда
	
		МассивТеней.Добавить(Тень2);
	
	КонецЕсли; 
	
	ЦветКнопки = ?(Акцент, Метаданные.ЭлементыСтиля.Акцент.Значение, Метаданные.ЭлементыСтиля.ЦветТемы.Значение);
	ЦветФонаНеактивнойКнопки = Метаданные.ЭлементыСтиля.НеактивнаяКнопка.Значение;
	ЦветТекстаНеактивнойКнопки = Метаданные.ЭлементыСтиля.НеактивныйЭлемент.Значение;
	
	Кнопка[Свойство] = ЗначениеСвойства;
	Если ЗначениеСвойства Тогда
		Кнопка.Видимость = Истина;
		Кнопка.Доступность = Истина;
	КонецЕсли;
	
	Если МенятьЦвет Тогда
		Кнопка.ЦветФонаКнопки 	=  ?(ЗначениеСвойства, ЦветКнопки, ЦветФонаНеактивнойКнопки);
		Кнопка.ЦветТекстаКнопки =  ?(ЗначениеСвойства, WebЦвета.Белый, 	ЦветТекстаНеактивнойКнопки);
		Кнопка.ЦветРамки = Кнопка.ЦветФонаКнопки;
	КонецЕсли;
	Для каждого Тень Из МассивТеней Цикл
		
		Тень.Видимость = ЗначениеСвойства;
		
	КонецЦикла; 
	
			
КонецПроцедуры

Процедура УстановитьДоступностьКнопки(ИмяКнопки, Доступность, Акцент = 0, Свойство = "", МенятьЦвет = Истина) Экспорт
	Свойство = "Доступность";
	УстановитьСвойствоКнопки(ИмяКнопки, Доступность, Акцент, Свойство, МенятьЦвет);
КонецПроцедуры

Процедура УстановитьВидимостьКнопки(ИмяКнопки, Доступность, Акцент = 0, Свойство = "", МенятьЦвет = Истина) Экспорт
	Свойство = "Видимость";
	УстановитьСвойствоКнопки(ИмяКнопки, Доступность, Акцент, Свойство, МенятьЦвет);
КонецПроцедуры

Процедура ОбновитьВремя() Экспорт
	Если Не ЭтаФорма.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДатаНаСервере = ТекущаяДатаНаСервере();
	тДата = Формат(ТекущаяДатаНаСервере,"ДФ='ddd, d MMMM'");
	тВремя = Формат(ТекущаяДатаНаСервере,"ДФ=HH:mm");
	тПользователь = ?(ЗначениеЗаполнено(глПользователь), Строка(глПользователь), "Система заблокирована");
	тТекущийРежим = ТекущийРежим; 										
	тБейдж = "";
	Если ТекущийДокумент = Неопределено Тогда
		тЗаказ = "";
		тБейдж = "";
	ИначеЕсли Не глФлагБлокировка Тогда
		Если ТекущийРежим = "ПРОДАЖА" Тогда
			КартаДоступа = Заказ.КартаДоступа;
			Идентификатор2 = КартаДоступа.Идентификатор2;
			Если ЗначениеЗаполнено(Идентификатор2) Тогда
				ИдентификаторКарты = Идентификатор2;
			Иначе
				ИдентификаторКарты = Прав(КартаДоступа.Идентификатор, 5);
			КонецЕсли;			
			тБейдж = "Бейдж " + ИдентификаторКарты;
		КонецЕсли;
				
	КонецЕсли;
	
	тРабочееМесто = глРабочееМесто;		
	//ПодключитьОбработчикОжидания("ЗаполнитьНадписиЛояльности",1,1);
	ПодключитьОбработчикОжидания("ОбновитьВремя",10,1);	
КонецПроцедуры

Процедура ОбновитьОстальное() Экспорт
	ОбновитьВремя();
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ДействияПередОткрытиемФормы(ЭтаФорма, Отказ);
КонецПроцедуры

Процедура ПриОткрытии()
	
	ПодключитьОбработчикОжидания("ОбновитьВремя",2,1);
	// вызов должен быть в конце обработчика
	ИнтерфейсРМ.ПриОткрытииОкна(ЭтаФорма);
	Стиль = БиблиотекаСтилей.СтанцияОплаты;
	ОбновитьНадписьИтого();
	
	ПодключитьОбработчикОжидания("Через2СекундыПослеОткрытия",0.1,1);
	УИДформы = Новый УникальныйИдентификатор;
	
	//Если глПараметрыРМ.Фирма = Справочники.МестаРеализации.Мяснов Тогда
	//	ЭтаФорма.Панель.Картинка = БиблиотекаКартинок.ЛогоКуулКлевер77;
	//ИначеЕсли Найти(глПараметрыРМ.Фирма, "Отдохни") Тогда
	//	ЭтаФорма.Панель.Картинка = БиблиотекаКартинок.ЛогоКуулКлевер77;
	//КонецЕсли;
	ЭлементыФормы.тпТовары.СоздатьКолонки();
	ИнтерфейсРМЛояльность.ФормаПриОткрытии(ЭтаФорма);
	
	ЭлементыФормы.тпТовары.Колонки.Автор.Видимость = ложь;
	ЭлементыФормы.тпТовары.Колонки.фАлкоголь.Видимость = ложь;
	ЭлементыФормы.тпТовары.Колонки.КоличествоНачальное.видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Блок.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Фирма.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.ИдСтроки.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Модифицирована.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.СтатусОплаты.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.СтатусДопИнф.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Статус.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Подача.Видимость = Ложь;
	
	ЭлементыФормы.тпТовары.Колонки.ГруппаАкции.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Цена.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Сумма.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Сумма.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.КоличествоУдалено.Видимость = Ложь;
		ЭлементыФормы.тпТовары.Колонки.Автор.Видимость = ложь;
	ЭлементыФормы.тпТовары.Колонки.фАлкоголь.Видимость = ложь;
	ЭлементыФормы.тпТовары.Колонки.КоличествоНачальное.видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Блок.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Фирма.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.ИдСтроки.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Модифицирована.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.СтатусОплаты.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.СтатусДопИнф.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.РабочееМесто.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.НомерМарки.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Статус.Видимость = Ложь;
	ЭлементыФормы.тпТовары.Колонки.Подача.Видимость = Ложь;


	//ЭлементыФормы.тпТовары.ТолькоПросмотр = истина;
	ЭлементыФормы.тпТовары.Шапка = Ложь;
	ЭлементыФормы.тпТовары.ВертикальныеЛинии = Ложь;
	ЭлементыФормы.тпТовары.Колонки.НомерСтроки.ОтображатьИерархию = Ложь;
	ЭлементыФормы.тпТовары.Колонки.НомерСтроки.ШрифтТекста = Новый Шрифт(ЭлементыФормы.тпТовары.Колонки.НомерСтроки.ШрифтТекста,,6);
	ЭлементыФормы.тпТовары.Колонки.НомерСтроки.Ширина = 2;
	ЭлементыФормы.тпТовары.Колонки.НомерСтроки.ВысотаЯчейки = 2;
	
	
КонецПроцедуры


Процедура Через2СекундыПослеОткрытия() Экспорт
	ОбновитьНадписьИтого();
	ЭтаФорма.ТолькоПросмотр = Истина;
	
	ПодключитьОбработчикОжидания("ВосстановитьФорму",0.1,1);
		
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ДействияПередЗакрытиемФормы(ЭтаФорма, Отказ);
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура ИнициализацияТаблицыТоваров()
	
КонецПроцедуры

Процедура тпТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура тпТоварыПослеУдаления(Элемент)
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура ЗаполнитьТПтовары() Экспорт
	
	Если ТекущийДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//:ТекущийДокумент = Документы.Заказ.СоздатьДокумент();
	
	// заполним таблицу на форме
	ТекСтрока = Неопределено;
	тпТовары.Строки.Очистить();
	Для каждого стр из ТекущийДокумент.Товары Цикл
		Если ОтборФирма И НЕ стр.Фирма = глПараметрыРМ.Фирма Тогда
			Продолжить;
		КонецЕсли;
		НовСтрока = тпТовары.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,стр);
		НовСтрока.Блок = НЕ стр.ДокументОплаты.Пустая();
		НовСтрока.Станция = глРабочееМесто.Станция;
		
		МС = ТекущийДокумент.Специфики.НайтиСтроки(Новый Структура("НомерСтрокиТовара",Стр.НомерСтроки));
		Для Каждого СтрокаСпецифика ИЗ МС Цикл
			НовСтрокаСпецифика = НовСтрока.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаСпецифика, СтрокаСпецифика);		
			НовСтрокаСпецифика.Товар = СтрокаСпецифика.Специфика;
			НовСтрокаСпецифика.СуммаРеализации = НовСтрокаСпецифика.ЦенаРеализации * НовСтрокаСпецифика.Количество;
		КонецЦикла;
				
		Если НовСтрока.Количество И не НовСтрока.Блок Тогда
			ТекСтрока = НовСтрока;
		КонецЕсли;
	КонецЦикла;

	Для Каждого Т Из тпТовары.Строки Цикл
		Если т.Строки.Количество() Тогда
			ЭлементыФормы.тпТовары.Развернуть(Т);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура тпТоварыПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	Если ДанныеСтроки = Неопределено Тогда
		ОформлениеСтроки.ЦветТекста = ОформлениеСтроки.ЦветФона;
		Возврат;
	КонецЕсли;
	
	Если ДанныеСтроки.фАлкоголь = 1 Тогда
		ОформлениеСтроки.Ячейки.Количество.Шрифт = Новый Шрифт("FontAwesome",24);
		ОформлениеСтроки.Ячейки.Количество.УстановитьТекст(Шрифты.ПолучитьСимвол("glass"));
		ОформлениеСтроки.Ячейки.Цена.ОтображатьТекст = 0;
	Иначе
		ОформлениеСтроки.Ячейки.х.УстановитьТекст("х");	
		Если ДанныеСтроки.Количество = 0 Тогда
			ОформлениеСтроки.Ячейки.Количество.УстановитьТекст(ДанныеСтроки.КоличествоНачальное);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеСтроки.Количество И не ДанныеСтроки.Уровень() Тогда
		ОформлениеСтроки.Ячейки.Равно.УстановитьТекст("=");	
	ИначеЕсли (ДанныеСтроки.Уровень() И ДанныеСтроки.Родитель.Количество = 0) Или ДанныеСтроки.Количество = 0 Тогда
		ОформлениеСтроки.Шрифт = Новый Шрифт(ОформлениеСтроки.Шрифт,,,,,,Истина); // зачеркнутый
	КонецЕсли; 
	
	Если ДанныеСтроки.Фирма <> глПараметрыРМ.Фирма Тогда
		ОформлениеСтроки.ЦветТекста = Метаданные.ЭлементыСтиля.НеактивнаяКнопка.Значение;
	КонецЕсли;
	
	Если ДанныеСтроки.СтатусОплаты = 1 Тогда
		ОформлениеСтроки.Ячейки.СуммаРеализации.ЦветФона = Метаданные.ЭлементыСтиля.БолееИнтенсивныйЗеленый.Значение;
		//ОформлениеСтроки.Ячейки.Сумма.ЦветФона = Метаданные.ЭлементыСтиля.ЦветФонаОплаченнойСтроки.Значение;
		//ОформлениеСтроки.Ячейки.Сумма.ЦветТекстаВыделения = Метаданные.ЭлементыСтиля.ЦветТемы.Значение;
	КонецЕсли;                                                                   	
	
	Если ДанныеСтроки.СтатусОплаты >= 0 Тогда
		ОформлениеСтроки.ЦветТекста =  Метаданные.ЭлементыСтиля.ЦветТекстаНедоступнойСтроки.Значение;
		//ОформлениеСтроки.ЦветТекстаВыделения = ОформлениеСтроки.ЦветТекста;
		//ОформлениеСтроки.ЦветФонаВыделения = Новый Цвет(255,255,255);
	КонецЕсли;
	
	Если ДанныеСтроки.Уровень() Тогда // это специфика
		ОформлениеСтроки.Ячейки.НомерСтроки.ВысотаЯчейки = 1;
		ОформлениеСтроки.Ячейки.НомерСтроки.ОтображатьТекст = 0;
		ОформлениеСтроки.Ячейки.Товар.УстановитьТекст("    - " + ДанныеСтроки.ТОвар);		
	КонецЕсли;    
	
	ОформлениеСтрокиЗаказа(Элемент, ОформлениеСтроки, ДанныеСтроки)	
КонецПроцедуры

Процедура ПриЗакрытии()
	
	ИнтерфейсРМ.ПриЗакрытииОкна();	
	AutohotkeyDLL = Неопределено;
КонецПроцедуры

Процедура СторноВсеНажатие(Элемент)
	СторноВсе();
	ОбновитьНадписьИтого();
КонецПроцедуры                 

Процедура тпТоварыТоварПриИзменении(Элемент)
	ЗаполнитьЗначенияСвойств(ЭлементыФормы.тпТовары.ТекущиеДанные, ЭлементыФормы.тпТовары.ТекущиеДанные.Товар);
	Если ЭлементыФормы.тпТовары.ТекущиеДанные.фАлкоголь Тогда
		ЭлементыФормы.тпТовары.ТекущиеДанные.ПДФ = ВводПДФ(ЭлементыФормы.тпТовары.ТекущиеДанные.Товар);
	КонецЕсли;
	ОбновитьНадписьИтого();
КонецПроцедуры
	
Процедура ПриЗакрытииМеню() Экспорт
	ЭлементыФормы.тпТовары.Высота = ВысотаТаблицыЗаказа;
	//ЭлементыФормы.ТеньТовары.Высота = ВысотаТаблицыЗаказа;
	ЭлементыФормы.тпТоварыВозврат.Высота = ВысотаТаблицыЗаказа;
КонецПроцедуры

Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	Если  Ложь Тогда ЗначениеВыбора = Справочники.Товары.ПустаяСсылка() КонецЕсли;
	Если ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.Товары") Тогда 
		Если Не ЗначениеЗаполнено(ТекКоличество) Или ТекКоличество = 1 Тогда
			
			Если ЗначениеВыбора.ЗапросКоличества Тогда
				ИзменитьКоличество();
			КонецЕсли;
	
		КонецЕсли;
		ВводНовойСтроки(ЗначениеВыбора);
	КонецЕсли;
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура ВыборМенюНажатие(Элемент)
	Если ВысотаТаблицыЗаказа = Неопределено Тогда
		ВысотаТаблицыЗаказа	= ЭлементыФормы.тпТовары.Высота;
		ВысотаПодвала		= ЭлементыФормы.КнопкаКоличество.Высота;
	КонецЕсли;
	СменаМенюПовара();
КонецПроцедуры

Процедура ПоискТовараНажатие(Элемент)
	Если фВводТоваровДоступен Тогда
		ОткрытьФормуПоиска();
		ОбновитьНадписьИтого();
	КонецЕсли;
КонецПроцедуры

Процедура ЗаблокироватьНажатие(Элемент)
	СброситьТекущийДокумент(Ложь);	
	Заблокировать(Истина);
КонецПроцедуры

Процедура ЗаблокироватьВформе() Экспорт
	ТолькоПросмотр = Ложь;
	Заблокировать(Истина);
	Cкрипт = "
	|#NoTrayIcon
	|WinWaitActive, ahk_pid %pid ahk_class V8TopLevelFrame
	|Sleep 100
	|Send {alt down}{shift down}{VK52}{alt up}{shift up}
	|Exitapp";	
	Cкрипт = СтрЗаменить(Cкрипт, "%pid", формат(РаботаСокнами.pid, "ЧГ=0"));
	AutohotkeyDLL.ahkTextDll(Cкрипт);		
	
	ПодключитьОбработчикОжидания("ПоказатьМенюПовара",0.3,1);
КонецПроцедуры

Процедура ПоказатьМенюПовара() Экспорт
	Если ВысотаТаблицыЗаказа = Неопределено Тогда
		ВысотаТаблицыЗаказа	= ЭлементыФормы.тпТовары.Высота;
		ВысотаПодвала		= ЭлементыФормы.КнопкаКоличество.Высота;
	КонецЕсли;
	СменаМенюПовара();
КонецПроцедуры

Процедура РежимАдминистратораНажатие(Элемент)
	ОткрытьМенюОпераций();
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура КоличествоНажатие(Элемент)
	ИзменитьКоличество();
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура СторноНажатие(Элемент)
	
	ТС = ЭлементыФормы.тпТовары.ТекущаяСтрока;
	Если ТС <> Неопределено Тогда
		НС = ТС.НомерСтроки;
	Иначе
		НС = 0;
	КонецЕсли;
	
	Сторно(НС);
	ОбновитьНадписьИтого();
КонецПроцедуры


Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ИзменениеСмены" Тогда
		//глПараметрыРМ.Вставить("НомерСмены", ИнтерфейсРМ.ТекущаяСмена().Номер);
		фВводТоваровДоступен = ЗначениеЗаполнено(ИнтерфейсРМ.ТекущаяСмена().Номер);
	ИначеЕсли ИмяСобытия = "ЗакрытМониторМарок" Тогда
		ПрочитатьТекущийДокумент();
		
		ПодключитьОбработчикОжидания("ПоказатьМенюПовара",0.1,1);
	КонецЕсли; 
КонецПроцедуры

Процедура кнЛояльностьНажатие(Элемент)
	МенюЛояльности();
	ОбновитьНадписьИтого();
КонецПроцедуры

Функция ПанелиСкрыты() Экспорт
	Если РежимТестирования Тогда
		Возврат Истина;
	КонецЕсли;
	Если фФормаСкрытияМеню = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Если ФормаСкрытияМеню.Открыта() Тогда
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Возврат Истина;
КонецФункции

Процедура ВводКартыГостя(Элемент)
	СброситьТекущийДокумент();	
КонецПроцедуры

Функция ПоказатьПлашки() Экспорт
	//УстановитьВидимостьКнопки("Плашка1",ЗначениеЗаполнено(ЭлементыФормы.Плашка1.Заголовок),,,Ложь);	
	//УстановитьВидимостьКнопки("Плашка2",ЗначениеЗаполнено(ЭлементыФормы.Плашка2.Заголовок),,,Ложь);	
	//ЭлементыФормы.НадписьЛояльность2.Видимость = 1;
	//ШиринаПашки = ЭлементыФормы.Плашка1Тень.Лево + ЭлементыФормы.Плашка1Тень.Ширина + 3;
	//Для Каждого Элемент Из мСдвигаемыеЭлементы Цикл
	//	былоЛево = Элемент.Лево;	
	//	Лево = ШиринаПашки + ?(СтрНайти(Элемент.Имя,"Тень"),3,0);
	//	Дельта = былоЛево - Лево;
	//	Если Дельта Тогда
	//		Элемент.Ширина = Элемент.Ширина + Дельта; 
	//		Элемент.Лево = Лево;
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	//ЭлементыФормы.КнопкаСкрытьПаказать.Заголовок = Шрифты.ПолучитьСимвол("arrow_circle_o_left");
	//ЭлементыФормы.КнопкаСкрытьПаказать.ЦветТекста = Метаданные.ЭлементыСтиля.АппБар.Значение;
	
КонецФункции

Функция СкрытьПлашки() Экспорт
	//УстановитьВидимостьКнопки("Плашка1",0,,,Ложь);
	//УстановитьВидимостьКнопки("Плашка2",0,,,Ложь);
	//ЭлементыФормы.НадписьЛояльность2.Видимость = 0;
	//Для Каждого Элемент Из мСдвигаемыеЭлементы Цикл
	//	былоЛево = Элемент.Лево;	
	//	Лево = 6 + ?(СтрНайти(Элемент.Имя,"Тень"),3,0);
	//	Дельта = былоЛево - Лево;
	//	Если Дельта Тогда
	//		Элемент.Лево = Лево;
	//		Элемент.Ширина = Элемент.Ширина + Дельта; 
	//	КонецЕсли;
	//КонецЦикла;	
	//ЭлементыФормы.КнопкаСкрытьПаказать.Заголовок = Шрифты.ПолучитьСимвол("arrow_circle_o_right");
	//ЭлементыФормы.КнопкаСкрытьПаказать.ЦветТекста = Метаданные.ЭлементыСтиля.Акцент.Значение;
КонецФункции
		
Процедура тпТоварыПриАктивизацииСтроки(Элемент)
	Попытка
		ТекущийЭлемент = ЭлементыФормы.Плашка11;
	Исключение
	КонецПопытки;
	Если ЭлементыФормы.тпТовары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элемент.ТекущиеДанные.СтатусОплаты = 1 Тогда
		Элемент.РежимВыделенияСтроки  = РежимВыделенияСтрокиТабличногоПоля.Ячейка;
	Иначе
		Элемент.РежимВыделенияСтроки  = РежимВыделенияСтрокиТабличногоПоля.Строка;
	КонецЕсли;
	ПоказатьЗаказНаМонитореГостя();
КонецПроцедуры

Процедура ПереключитьФильтр(Элемент)
	ОтборФирма = Не ОтборФирма;
	//Если ОтборФирма.Использование Тогда
	//	Элемент.Картинка = БиблиотекаКартинок.НеФильтр;
	//Иначе
	//	Элемент.Картинка = БиблиотекаКартинок.Фильтр;
	//КонецЕсли;
	ОбновитьВремя();
КонецПроцедуры

Процедура тпТоварыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	ПоказатьИнформациюОтоваре(Элемент.ТекущиеДанные.Товар);
КонецПроцедуры

Функция ПоказатьИнформациюОтоваре(Товар) Экспорт
	Обработка = ИнтерфейсРМ.ПолучитьОбъектОбработки("ИнформацияОтоваре");
	//: Обработка = Обработки.ИнформацияОтоваре.Создать();
	Обработка.Товар = Товар;
	Обработка.ПолучитьФорму().ОткрытьМодально();
КонецФункции

Процедура ПлашкаКупонНажатие(Элемент) Экспорт 
	ИнтерфейсРМЛояльность.ПлашкаКупонНажатие(ЭтаФорма, Элемент);
КонецПроцедуры

Процедура Плашка_Н_Нажатие(Элемент) Экспорт 
	ИнтерфейсРМЛояльность.Плашка_Н_Нажатие(ЭтаФорма, Элемент);
	//ЛояльностьДанныеЗаказа = ИнтерфейсРМЛояльность.ОбновитьТовары(ЭтаФорма);
	ЭлементыФормы.тпТовары.ОбновитьСтроки();
КонецПроцедуры

Процедура тпТоварыПриПолученииДанных(Элемент, ОформленияСтрок)
	ИнтерфейсРМЛояльность.тпТоварыПриПолученииДанных(ЭтаФорма, Элемент, ОформленияСтрок, ЛояльностьДанныеЗаказа);
КонецПроцедуры

#Область ВЕСЫ

Процедура кнВесыНажатие(Элемент)
	глОтсечкаПростоя();
	Если ЗаказНеВыбран() Тогда
		Возврат;
	КонецЕсли;
	МенюВесов(Вес);
	ОбновитьНадписьИтого();
КонецПроцедуры

Процедура ОбновитьВес() Экспорт
	Если Не ЭтаФорма.Открыта() Тогда
		Возврат;
	КонецЕсли;
	ЭлементыФормы.тВес.Заголовок = Формат(Вес,"ЧДЦ=3; ЧРД=.; ЧН=0.000");
	Если фВводТоваровДоступен = Истина Тогда
		ИнтерфейсРМ.ВыводНаИнфоДисплей("ПоказатьВес",,,,,Вес);	
	КонецЕсли;
КонецПроцедуры

Процедура тпТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЭлементыФормы.тпТовары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВводНовойСтроки(ВыбранноеЗначение);
	
КонецПроцедуры

Процедура КнопкаИнфоНажатие(Элемент)
	Если ЭлементыФормы.тпТовары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Уровень = ЭлементыФормы.тпТовары.ТекущаяСтрока.Уровень();
	Если Уровень Тогда
		ПоказатьИнформациюОтоваре(ЭлементыФормы.тпТовары.ТекущиеДанные.Родитель.Товар);
	Иначе
			ПоказатьИнформациюОтоваре(ЭлементыФормы.тпТовары.ТекущиеДанные.Товар);
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаКоличествоНажатие(Элемент)
	Если ЭлементыФормы.тпТовары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзменитьКоличество() Тогда
		ОбновитьНадписьИтого();
	КонецЕсли;
	
КонецПроцедуры

Процедура КнопкаСпецификиНажатие(Элемент)
	Если ЭлементыФормы.тпТовары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Выбор специфики
	//
	ВыборСпецифики();
КонецПроцедуры

Процедура КнопкаОбщиеСпецификиНажатие(Элемент)
	Если ЭлементыФормы.тпТовары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ВыборСпецифики(Истина);
КонецПроцедуры

Процедура кнМаркиНажатие(Элемент)
	Попытка
		ФормаПодбораТоваров.Закрыть();	
	Исключение
	КонецПопытки;
	
	МониторМарок();
КонецПроцедуры

Процедура кнПейджерНажатие(Элемент)
	ВозвратПейджера();
КонецПроцедуры

Процедура КнопкаСтрелкаВверхНажатие(Элемент)
	
	ФормаПодбораТоваров.Пролистать(-1);
	
КонецПроцедуры

Процедура КнопкаСтрелкаВнизНажатие(Элемент)
	
	ФормаПодбораТоваров.Пролистать(1);
	
КонецПроцедуры

Процедура КнопкаВыдачаНажатие(Элемент)
	ИзменитьКурс(Истина);
КонецПроцедуры

#КонецОбласти

тПользователь = "";
тЗаказ = "";

фФормаСкрытияМеню = 0;

МассивЧисла = Новый Массив;
МассивЧисла.Добавить(Тип("Число"));

МассивТоварСпецифика = Массив(Тип("СправочникСсылка.Товары"), Тип("СправочникСсылка.Специфики"));
тпТовары.Строки.Очистить();
тпТовары.Колонки.Очистить();
тпТовары.Колонки.Добавить("НомерСтроки",Новый ОписаниеТипов("Число"),"N",5);

тпТовары.Колонки.Добавить("Автор",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"),,1);
тпТовары.Колонки.Добавить("Товар",Новый ОписаниеТипов(МассивТоварСпецифика),,60);
тпТовары.Колонки.Добавить("Количество",Новый ОписаниеТипов(МассивЧисла,,Новый КвалификаторыЧисла(15,3)),,9);
тпТовары.Колонки.Добавить("КоличествоУдалено",Новый ОписаниеТипов(МассивЧисла,,Новый КвалификаторыЧисла(15,3)),,9);
тпТовары.Колонки.Добавить("х",,,1);
тпТовары.Колонки.Добавить("ЦенаРеализации",Новый ОписаниеТипов(МассивЧисла,,Новый КвалификаторыЧисла(15,2)),,9);
тпТовары.Колонки.Добавить("Равно",,,1);
тпТовары.Колонки.Добавить("СуммаРеализации",Новый ОписаниеТипов(МассивЧисла,,Новый КвалификаторыЧисла(15,2)),,10);
тпТовары.Колонки.Добавить("фАлкоголь",,,8);
тпТовары.Колонки.Добавить("КоличествоНачальное",Новый ОписаниеТипов(МассивЧисла,,Новый КвалификаторыЧисла(15,3)),,9);
тпТовары.Колонки.Добавить("Подача");
тпТовары.Колонки.Добавить("блок",Новый ОписаниеТипов("Булево"),,1);

тпТовары.Колонки.Добавить("Фирма", Новый ОписаниеТипов("СправочникСсылка.Фирмы"),,1); 
тпТовары.Колонки.Добавить("ИдСтроки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(30)),,1); 
тпТовары.Колонки.Добавить("СтатусОплаты",Новый ОписаниеТипов("Число"),,1);
тпТовары.Колонки.Добавить("Модифицирована",Новый ОписаниеТипов("Булево"),,1);

тпТовары.Колонки.Добавить("ЛояльностьГруппаАкции",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(5,0)),,1);

тпТовары.Колонки.Добавить("Цена",Новый ОписаниеТипов(МассивЧисла,,Новый КвалификаторыЧисла(15,2)),,0);
тпТовары.Колонки.Добавить("НомерМарки",Новый ОписаниеТипов(МассивЧисла,,Новый КвалификаторыЧисла(15,0)),,0);
тпТовары.Колонки.Добавить("Сумма",Новый ОписаниеТипов(МассивЧисла,,Новый КвалификаторыЧисла(15,2)),,0);
тпТовары.Колонки.Добавить("Статус",Новый ОписаниеТипов(Массив(Тип("ПеречислениеСсылка.СтатусыПозицийЗаказа")),,Новый КвалификаторыЧисла(15,2)),,0);
тпТовары.Колонки.Добавить("СтатусДопИнф",Новый ОписаниеТипов(Массив(Тип("ПеречислениеСсылка.СтатусыПозицийЗаказа")),,Новый КвалификаторыЧисла(15,2)),,0);
тпТовары.Колонки.Добавить("РабочееМесто",Новый ОписаниеТипов(Массив(Тип("СправочникСсылка.РабочиеМеста"))));
тпТовары.Колонки.Добавить("Станция",Новый ОписаниеТипов(Массив(Тип("СправочникСсылка.Станции"))));

//ВЕСЫ
Если глПараметрыРМ.ВесыЕсть Тогда
	Весы = глПараметрыРМ.Весы.ПолучитьОбъект();
	Обработка_Весы = Обработка_Весы;
	ИнициализацияТО(Весы, Обработка_Весы, глПараметрыРМ);
КонецЕсли;

//ОтборФирма = ЭлементыФормы.тпТовары.ОтборСтрок.Фирма;
//ОтборФирма.ВидСравнения = ВидСравнения.Равно;	 
//ОтборФирма.Значение = глПараметрыРМ.Фирма;
//ОтборФирма.Использование = Истина;
Попытка
	AutohotkeyDLL = РаботаСокнами.AHK(,"ГлавнаяФорма");
Исключение
КонецПопытки;
//ФормаСкрытияМеню = Обработки.СкрытьМенюИПанели.ПолучитьФорму();
//ФормаСкрытияМеню.Открыть();	
ОтборФирма = Истина;
